small twiks + architecture added
